In [1]:
%load_ext sql
import sqlite3

In [2]:
%sql sqlite:///CourseDataWarehouse.db

'Connected: @CourseDataWarehouse.db'

# 7. Datawarehouse Integrity Tests

## A. How many courses are offered in 2018?

In [38]:
%%sql 
SELECT TERM, count(DISTINCT CATALOG_ID)
FROM COURSE_FACTS
    JOIN CALENDAR_DATES USING (TERM)
WHERE TERM LIKE '%2018%'
GROUP BY TERM

 * sqlite:///CourseDataWarehouse.db
Done.

[('Fall2018', 612),
 ('Spring2018', 642),
 ('Summer2018', 151),
 ('Winter2018', 9)]

## B. How many courses are offered in Bannow?

In [41]:
%%sql
SELECT count(DISTINCT CATALOG_ID)
FROM COURSE_FACTS
    JOIN LOCATIONS USING (LOCATION_ID)
WHERE ROOM_ID LIKE '%BNW%'

 * sqlite:///CourseDataWarehouse.db
Done.

[(612,)]

## C. How many courses has each professor taught?

In [19]:
%%sql
--How to count distinct catalog_id a
SELECT INSTRUCTOR_ID, INSTRUCTOR_NAME, count(CATALOG_ID)
FROM COURSE_FACTS
    JOIN INSTRUCTORS USING (INSTRUCTOR_ID)
GROUP BY INSTRUCTOR_ID
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[(1, 'Michael P.  Coyne', 56, 56),
 (2, 'Rebecca I.  Bloch', 55, 55),
 (3, 'Paul   Caster', 62, 62),
 (4, 'Jo Ann   Drusbosky', 70, 70),
 (5, 'Arleen N.  Kardos', 44, 44),
 (6, 'Scott M  Brenner', 51, 51),
 (7, 'Kevin C.  Cassidy', 8, 8),
 (8, 'Bruce   Bradford', 60, 60),
 (9, 'Milo W.  Peck', 118, 118),
 (10, 'Stephen E.  Yost', 39, 39)]

## D. How many courses are in each program?

In [34]:
%%sql
SELECT PROGRAM_ID, PROGRAM_NAME, count(DISTINCT CATALOG_ID)
FROM COURSE_FACTS
    JOIN PROGRAMS USING (PROGRAM_ID)
GROUP BY PROGRAM_ID
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[(1, 'Accounting', 25),
 (2, 'Applied Ethics', 12),
 (3, 'Art History', 27),
 (4, 'Asian Studies', 1),
 (5, 'Arabic', 6),
 (6, 'American Studies', 21),
 (7, 'Anthropology', 16),
 (8, 'Business', 10),
 (9, 'Bioengineering', 5),
 (10, 'Biology', 81)]

## E. On Thursday's how many classes are offered at lunch-time in the Spring 2019 semester?

In [35]:
%%sql
SELECT DAY, START, TERM, count(CATALOG_ID)
FROM COURSE_FACTS
    JOIN TIME_SLICES USING (TIMECODE)
WHERE DAY = 'R' and START = '12:30:00' and TERM = 'Spring2019'

 * sqlite:///CourseDataWarehouse.db
Done.

[('R', '12:30:00', 'Spring2019', 66)]